## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.grants_source_data_bucket.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
      ~ policy                      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
-                           StringEquals    = {
-                               "AWS:SourceAccount" = "357150818708"
-                               "AWS:SourceArn"     = "arn:aws:ses:us-west-2:357150818708:receipt-rule-set/ffis_ingest-rule-set:receipt-rule/ffis_ingest-staging"
                            } -> null
+                           StringNotEquals = {
+                               "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
                      ~ Effect    = "Allow" -> "Deny"
                      ~ Principal = {
-                           Service = "ses.amazonaws.com"
                        } -> "*"
                      ~ Resource  = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/ses/*" -> "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/*"
                      ~ Sid       = "" -> "DenyIncorrectEncryptionHeader"
                        # (1 unchanged element hidden)
                    },
+                   {
+                       Action    = "s3:PutObject"
+                       Condition = {
+                           Null = {
+                               "s3:x-amz-server-side-encryption" = "true"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/*"
+                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
+                   {
+                       Action    = "s3:*"
+                       Condition = {
+                           Bool = {
+                               "aws:SecureTransport" = "false"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = [
+                           "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/*",
+                           "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2",
                        ]
+                       Sid       = "ForceSSLOnlyAccess"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags                        = {
            "Attributes" = "357150818708-us-west-2"
            "Name"       = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
            "Namespace"  = "grantsingest-staging"
        }
        # (10 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket_policy.ses_source_data_s3_access_policy will be destroyed
  # (because aws_s3_bucket_policy.ses_source_data_s3_access_policy is not in configuration)
-   resource "aws_s3_bucket_policy" "ses_source_data_s3_access_policy" {
-       bucket = "grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null
-       id     = "grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           StringNotEquals = {
-                               "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/*"
-                       Sid       = "DenyIncorrectEncryptionHeader"
                    },
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           Null = {
-                               "s3:x-amz-server-side-encryption" = "true"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/*"
-                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = "false"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = [
-                           "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/*",
-                           "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2",
                        ]
-                       Sid       = "ForceSSLOnlyAccess"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_ses_receipt_rule.ffis_ingest will be created
+   resource "aws_ses_receipt_rule" "ffis_ingest" {
+       arn           = (known after apply)
+       enabled       = true
+       id            = (known after apply)
+       name          = "grants_ingest-staging-ffis_ingest"
+       recipients    = [
+           "ffis-ingest@staging.grants.usdigitalresponse.org",
        ]
+       rule_set_name = "ffis_ingest-rule-set"
+       scan_enabled  = true
+       tls_policy    = "Require"

+       s3_action {
+           bucket_name       = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+           object_key_prefix = "ses/ffis_ingest/new"
+           position          = 1
        }
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.grants_source_data_bucket.aws_s3_bucket_policy.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "default" {
        id     = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action    = "s3:*"
                        Condition = {
                            Bool = {
                                "aws:SecureTransport" = [
                                    "false",
                                ]
                            }
                        }
                        Effect    = "Deny"
                        Principal = "*"
                        Resource  = [
                            "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/*",
                            "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2",
                        ]
                        Sid       = "ForceSSLOnlyAccess"
                    },
+                   {
+                       Action    = "s3:PutObject"
+                       Condition = {
+                           StringEquals = {
+                               "AWS:SourceAccount" = [
+                                   "357150818708",
                                ]
+                               "AWS:SourceArn"     = [
+                                   "arn:aws:ses:us-west-2:357150818708:receipt-rule-set/ffis_ingest-rule-set:receipt-rule/ffis_ingest-staging",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ses.amazonaws.com"
                        }
+                       Resource  = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/ses/*"
+                       Sid       = "ses_source_data_s3_access"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-25T20:29:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:15/invocations" -> (known after apply)
      ~ s3_key                         = "builds/3fabfa3292d21098d09e40d754cb8ed6245d76bf6de8d9354ca6435c5522172a.zip" -> "builds/1e83d1d1e75435cb907e37572fbc265721b55bf0351bd97b29b0b1e114faf1e3.zip"
      ~ s3_object_version              = "_713Wl3Jb_XU1wAnkglu2AZICdvgni8w" -> (known after apply)
        tags                           = {}
      ~ version                        = "15" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:d298b9b95ea63fcb48222d627557e1b9ad89a96e,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:20bcae4ed920682e14c4d76978b704f5a7c2d460,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "d298b9b95ea63fcb48222d627557e1b9ad89a96e" -> "20bcae4ed920682e14c4d76978b704f5a7c2d460"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "15" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fac689570ce14c68e92e136318641d0f-2" -> (known after apply)
      ~ id                     = "builds/3fabfa3292d21098d09e40d754cb8ed6245d76bf6de8d9354ca6435c5522172a.zip" -> (known after apply)
      ~ key                    = "builds/3fabfa3292d21098d09e40d754cb8ed6245d76bf6de8d9354ca6435c5522172a.zip" -> "builds/1e83d1d1e75435cb907e37572fbc265721b55bf0351bd97b29b0b1e114faf1e3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/3fabfa3292d21098d09e40d754cb8ed6245d76bf6de8d9354ca6435c5522172a.zip" -> "builds/1e83d1d1e75435cb907e37572fbc265721b55bf0351bd97b29b0b1e114faf1e3.zip"
-       tags                   = {} -> null
      ~ version_id             = "_713Wl3Jb_XU1wAnkglu2AZICdvgni8w" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/1e83d1d1e75435cb907e37572fbc265721b55bf0351bd97b29b0b1e114faf1e3.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/1e83d1d1e75435cb907e37572fbc265721b55bf0351bd97b29b0b1e114faf1e3.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8422417065109728952" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3fabfa3292d21098d09e40d754cb8ed6245d76bf6de8d9354ca6435c5522172a.zip" -> "builds/1e83d1d1e75435cb907e37572fbc265721b55bf0351bd97b29b0b1e114faf1e3.zip"
          ~ "timestamp" = "1682454443541738000" -> "1682456451626427000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8273933184840928477" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/3fabfa3292d21098d09e40d754cb8ed6245d76bf6de8d9354ca6435c5522172a.zip" -> "builds/1e83d1d1e75435cb907e37572fbc265721b55bf0351bd97b29b0b1e114faf1e3.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-25T20:29:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:14" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:14/invocations" -> (known after apply)
      ~ s3_key                         = "builds/ba17ced7ad3cb819e4925ad13a1c08d575b64bbb4076f49f5b64e861068f92b8.zip" -> "builds/12a11b74afd3d51e000a660edfb758da92bdd9c6e41439d5f35ddb665f7955ad.zip"
      ~ s3_object_version              = "GBYWuSP5wIayPSTlXvHxOgUQiliq5vAH" -> (known after apply)
        tags                           = {}
      ~ version                        = "14" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:d298b9b95ea63fcb48222d627557e1b9ad89a96e,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:20bcae4ed920682e14c4d76978b704f5a7c2d460,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "d298b9b95ea63fcb48222d627557e1b9ad89a96e" -> "20bcae4ed920682e14c4d76978b704f5a7c2d460"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "14" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "57ccccae1eb1fc9d1a6d5663bf46ff96-2" -> (known after apply)
      ~ id                     = "builds/ba17ced7ad3cb819e4925ad13a1c08d575b64bbb4076f49f5b64e861068f92b8.zip" -> (known after apply)
      ~ key                    = "builds/ba17ced7ad3cb819e4925ad13a1c08d575b64bbb4076f49f5b64e861068f92b8.zip" -> "builds/12a11b74afd3d51e000a660edfb758da92bdd9c6e41439d5f35ddb665f7955ad.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/ba17ced7ad3cb819e4925ad13a1c08d575b64bbb4076f49f5b64e861068f92b8.zip" -> "builds/12a11b74afd3d51e000a660edfb758da92bdd9c6e41439d5f35ddb665f7955ad.zip"
-       tags                   = {} -> null
      ~ version_id             = "GBYWuSP5wIayPSTlXvHxOgUQiliq5vAH" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/12a11b74afd3d51e000a660edfb758da92bdd9c6e41439d5f35ddb665f7955ad.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/12a11b74afd3d51e000a660edfb758da92bdd9c6e41439d5f35ddb665f7955ad.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2356553587867691353" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ba17ced7ad3cb819e4925ad13a1c08d575b64bbb4076f49f5b64e861068f92b8.zip" -> "builds/12a11b74afd3d51e000a660edfb758da92bdd9c6e41439d5f35ddb665f7955ad.zip"
          ~ "timestamp" = "1682454443609549000" -> "1682456451754376800"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3985785295814718072" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/ba17ced7ad3cb819e4925ad13a1c08d575b64bbb4076f49f5b64e861068f92b8.zip" -> "builds/12a11b74afd3d51e000a660edfb758da92bdd9c6e41439d5f35ddb665f7955ad.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 11 to add, 7 to change, 9 to destroy.
```

</details>

*Pusher: @slapula, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4802127346)*